property-finder/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 52], ["LIMIT", 1]]
---
  def show
    @post = Post.where(id: params[:id]).first